[
    {
      "id": 1,
      "name": "House Targaryen",
      "description": "House Targaryen is one of the most legendary and influential families in the history of Westeros, whose story is entwined with the rise and fall of the Iron Throne itself. Originating from the ancient Valyrian Freehold, House Targaryen was founded by Aegon I Targaryen, also known as Aegon the Conqueror, who unified the Seven Kingdoms under his rule in a brutal and unyielding campaign that reshaped Westeros forever. The Targaryens are most famously known for their connection to dragons, their most powerful weapon, with their sigil—a red three-headed dragon on a black field—symbolizing both their Valyrian ancestry and their dominion over the skies through their dragons. Their motto, \"Fire and Blood,\" reflects both the fiery nature of their dragons and the violent history of their family, which is marked by conquest, warfare, and bloodshed. The Targaryens ruled Westeros for nearly 300 years, with their reign marked by periods of both peace and great turmoil. The family’s early days were filled with prosperity, but over time, their bloodline became increasingly unstable, as generations of inbreeding to preserve the purity of their Valyrian blood led to mental instability and a descent into madness. Kings like Aerys II, known as the Mad King, exemplified the tragic downfall of House Targaryen, which ended with Robert’s Rebellion. Despite their fall from power, the Targaryens’ legacy continues, with their bloodline surviving in the form of Daenerys Targaryen, who would go on to seek to reclaim the Iron Throne. The Targaryens' unique ability to control and ride dragons remains a defining trait, and their family is often remembered for their undeniable impact on the history and politics of Westeros, with their story blending triumph, tragedy, and the ever-present shadow of fire and blood.",
      "image": "https://got-api-production.up.railway.app/assets/House_Targaryen.webp"
    },
    {
      "id": 2,
      "name": "House Stark",
      "description": "House Stark is one of the most ancient and revered noble families in Westeros, with a lineage that traces back thousands of years. As the rulers of the North, House Stark commands the largest and most rugged region of the Seven Kingdoms, with their ancestral seat at Winterfell, a vast and imposing castle nestled in the heart of the frozen North. The Starks are known for their honor, their stoic nature, and their deep connection to the harsh, unforgiving land they call home. Their sigil—a grey direwolf on a white field—represents both their strength and resilience, as well as their close bond with the direwolves that roam the North, creatures that are symbols of loyalty and fierceness. The Stark motto, \"Winter is Coming,\" is a constant reminder of the harsh realities of life in the North, a warning that even in the warmer seasons, the cold and danger of winter are never far off. The Stark family has been the ruling house of the North for countless generations, having served as Wardens of the North, responsible for defending their lands from the threats beyond the Wall and maintaining peace in the vast and isolated region. Their sense of duty to their people, as well as their unshakable belief in honor, has earned them respect across Westeros, even from rival houses. However, the Starks’ noble ideals have often put them at odds with the ruthless politics of the South, leading to conflict and betrayal. The rise and fall of the Stark family has been marked by personal sacrifices and heartbreaking tragedies, from the executions of Eddard Stark and his son Robb Stark to the destruction of their ancestral home during the War of the Five Kings. Despite these losses, House Stark remains an enduring symbol of resilience, honor, and the unbreakable spirit of the North. With figures like Jon Snow and Sansa Stark carrying on their legacy, House Stark’s story is one of survival against all odds and an unwavering commitment to family, duty, and the values of the North.",
      "image": "https://got-api-production.up.railway.app/assets/House_Stark.webp"
    },
    {
      "id": 3,
      "name": "House Lannister",
      "description": "House Lannister is one of the wealthiest and most powerful families in Westeros, and their influence reaches far beyond the borders of their home in the Westerlands. Their seat is Casterly Rock, an ancient and nearly impregnable fortress situated on a rocky peninsula that overlooks the Sunset Sea. House Lannister’s sigil—a golden lion on a crimson field—symbolizes both their regal authority and their fierce nature. The lion, a symbol of strength and nobility, represents the Lannisters’ commanding presence in the Seven Kingdoms, while the gold, a reference to their immense wealth, emphasizes the family’s prosperity and status as the richest house in Westeros. Their motto, \"Hear Me Roar!\" is the official family slogan, though many know them better by the saying, \"A Lannister always pays his debts,\" which is a reflection of their commitment to financial and personal honor, no matter the cost. Over the centuries, House Lannister has accumulated great power through a combination of wealth, cunning, and political maneuvering, always ensuring that their influence remains dominant in the courts of King’s Landing and across Westeros. Members of House Lannister have held important positions of power, including the roles of Hand of the King, Master of Coin, and even the title of King of the Rock. The family’s strategic marriages have strengthened their political standing, with key unions such as that of Tywin Lannister to the powerful House Reyne and the infamous engagement of Cersei Lannister to King Robert Baratheon. Tywin Lannister, the head of the house for much of the series, was a shrewd and ruthless ruler, known for his military genius, cold pragmatism, and unwavering commitment to preserving the Lannister name. His children, Jaime, Cersei, and Tyrion, each played pivotal roles in shaping the family's destiny, though often at great personal cost. Jaime was a knight of great renown, Cersei sought power as Queen, and Tyrion, though physically smaller, used his sharp wit to survive in the brutal political game of Westeros. The Lannisters’ vast wealth and political power made them a force to be reckoned with, but their internal family struggles, infidelity, and ambition also led to their eventual downfall. Despite their tragic flaws, House Lannister’s legacy remains one of wealth, ambition, and influence, leaving an indelible mark on the history of Westeros.",
      "image": "https://got-api-production.up.railway.app/assets/House_Lannister.webp"
    },
    {
      "id": 4,
      "name": "House Arryn",
      "description": "House Arryn is a noble family of the Vale of Arryn, one of the Seven Kingdoms of Westeros, known for their stronghold at the Eyrie, a fortress high in the Mountains of the Moon. Their sigil, a blue falcon soaring above a crescent moon, symbolizes their dominance over the sky and their strategic position in the mountains, making the Eyrie nearly impregnable. The Arryns are one of the Great Houses, holding the title of Lords of the Vale and, for a time, the role of Wardens of the East. The family's motto, \"As High as Honor,\" reflects both their lofty position in the Vale and their pride in maintaining the highest standards of integrity and justice. House Arryn’s history is marked by a reputation for strong leadership and political neutrality, though their power has often been overshadowed by the more prominent houses of Westeros. The most notable figures from House Arryn include Jon Arryn, the former Hand of the King to Robert Baratheon, whose death sparked the series of events that led to the War of the Five Kings. The family’s influence is largely tied to their strategic position, which controls the passage through the mountains, making them essential to the defense of the realm’s eastern borders. Despite their history of stability, the Arryns have been deeply affected by internal strife and the loss of key members, leaving the house vulnerable and its legacy uncertain.",
      "image": "https://got-api-production.up.railway.app/assets/House_Arryn.webp"
    },
    {
      "id": 5,
      "name": "House Tully",
      "description": "House Tully is a noble family of the Riverlands, with their seat at Riverrun, a castle located at the confluence of the Red Fork and the Tumblestone River. Known for their honor, loyalty, and strong sense of duty, the Tullys have long been regarded as one of the stabilizing forces in the Seven Kingdoms. Their sigil, a leaping silver trout on a blue and red striped field, represents the family’s connection to the waters of their lands, and the trout is often seen as a symbol of strength, perseverance, and adaptability. The Tully motto, \"Family, Duty, Honor,\" underscores the values that have guided the house for centuries, emphasizing the importance of kinship, responsibility, and upholding one's word. The Tullys have played significant roles in various conflicts, often acting as mediators or leaders in times of war. Their loyalty to the crown has been tested time and again, but they have remained steadfast, even in the face of devastating loss. Key figures from House Tully include Hoster Tully, the lord of Riverrun during the War of the Five Kings, and his children—Catelyn Stark, who married Eddard Stark, and Edmure Tully, who took on a crucial military role during the war. House Tully’s fortunes have fluctuated throughout history, but their reputation for integrity and their deep commitment to family and duty have ensured that their legacy endures through the turbulent years.",
      "image": "https://got-api-production.up.railway.app/assets/House_Tully.webp"
    },
    {
      "id": 6,
      "name": "House Greyjoy",
      "description": "House Greyjoy is the ruling family of the Iron Islands, a harsh and isolated group of rocky islands off the western coast of Westeros. Their seat is at Pyke, a castle perched atop jagged cliffs overlooking the sea. Known for their fierce independence, the Greyjoys follow the ancient ways of the Ironborn, a people who worship the Drowned God and live by the motto \"We Do Not Sow,\" which reflects their belief in taking what they need through strength, raiding, and conquest rather than through farming and labor. Their sigil is a golden kraken on a black field, symbolizing both their mastery over the sea and the terrifying power of the kraken, a mythical sea creature. House Greyjoy's history is filled with rebellions, raids, and attempts to carve out a kingdom from the Seven Kingdoms, with their leaders often seen as wild and unpredictable. Balon Greyjoy, the most recent Lord of the Iron Islands, led a rebellion against Robert Baratheon’s rule, though it was swiftly crushed, leaving the Iron Islands weakened and their power diminished. Despite their history of defiance, the Greyjoys maintain a sense of pride and autonomy, with their people living by their own code of conduct, built around strength, courage, and loyalty to their house. The family has been shaped by the sea, with their warriors and ships known across the realm, and their desire to reclaim a power that was lost long ago. Despite the challenges they face, House Greyjoy continues to cling to their traditions, hoping one day to regain the prominence they once had.",
      "image": "https://got-api-production.up.railway.app/assets/House_Greyjoy.webp"
    },
    {
      "id": 7,
      "name": "House Baratheon",
      "description": "House Baratheon is a powerful and ambitious noble family, originally hailing from the stormlands, where they rule from the stronghold of Storm’s End. Their sigil, a crowned black stag on a gold field, symbolizes both their strength and their royal aspirations, as they once took the throne of the Seven Kingdoms through Robert Baratheon’s rebellion against the Targaryens. Known for their fiery tempers and unwavering courage, the Baratheons have a reputation for being formidable warriors, unyielding in battle and determined to maintain their dominance. Their motto, \"Ours is the Fury,\" reflects their passionate and sometimes volatile nature, as well as their readiness to fight for what they believe is rightfully theirs. House Baratheon was elevated to royal status following Robert’s Rebellion, and Robert himself became the first king of the Baratheon dynasty. After his death, the Baratheon line became fractured, with his brothers Stannis and Renly each claiming the throne, leading to civil war during the War of the Five Kings. Despite internal divisions, House Baratheon has maintained a significant presence in Westeros, with their lands in the stormlands and their control over powerful armies. The Baratheon bloodline is marked by a fierce devotion to their house and a burning desire for power, with the shadow of Robert's legacy continuing to haunt the family. Their story is one of triumph, division, and struggle, as they navigate the perilous political landscape of the Seven Kingdoms.",
      "image": "https://got-api-production.up.railway.app/assets/House_Baratheon.webp"
    },
    {
      "id": 8,
      "name": "House Tyrell",
      "description": "House Tyrell is one of the wealthiest and most influential families in Westeros, ruling over the fertile and prosperous region of the Reach from their seat at Highgarden. Known for their vast lands and agricultural wealth, the Tyrells are key players in the politics of the Seven Kingdoms, with a reputation for both ambition and subtlety. Their sigil is a golden rose on a green field, symbolizing their connection to the lush, blooming fields of the Reach, as well as their ability to grow and thrive in any circumstance. The Tyrell motto, \"Growing Strong,\" reflects their steadfastness, resilience, and belief in the power of growth—both in terms of their lands and their influence. The Tyrells have a long history of aligning themselves with the powerful, carefully maneuvering through political alliances to strengthen their position. Their influence was cemented when Mace Tyrell’s daughter, Margaery Tyrell, became queen by marrying King Renly Baratheon and later King Tommen Baratheon. Despite their outward charm and grace, the Tyrells are a family of sharp political minds, using marriage, alliances, and strategic moves to maintain their power and influence. Key figures in the family include the honorable and often patient Mace Tyrell, as well as his clever children—Loras Tyrell, a renowned knight, and Margaery, whose beauty and cunning made her a powerful force in court. Though they are often seen as a house of elegance and diplomacy, House Tyrell is not without its ruthless streak, always calculating the best way to ensure their family's prosperity and their continued place in the power structure of Westeros.",
      "image": "https://got-api-production.up.railway.app/assets/House_Tyrell.webp"
    },
    {
      "id": 9,
      "name": "House Martell",
      "description": "House Martell is the ruling family of Dorne, the southernmost region of Westeros, known for its hot climate, desert landscapes, and fierce independence. Their seat is at Sunspear, a palace located in the heart of Dorne, overlooking the sands of the desert and the warm waters of the Summer Sea. The Martells are a proud and distinct family, with a culture and identity that sets them apart from the other great houses of Westeros. Their sigil is a red sun pierced by a gold spear, symbolizing both the scorching heat of the Dorne sun and the strength of the spear, a weapon of war and honor. The Martells have long been known for their commitment to justice, their pursuit of vengeance, and their strong sense of family loyalty. Their motto, \"Unbowed, Unbent, Unbroken,\" speaks to their resilience and unyielding nature, having never been defeated in battle or broken by adversity. The Martells have a complicated history with the other noble houses, having resisted outside rule and rejected the traditional Westerosi customs of marriage, choosing instead to maintain their own practices, including polyandry and polygyny. Their reputation for holding grudges is well-known, and the family’s desire for revenge and justice often takes center stage in their political ambitions. The most prominent members of House Martell include Prince Doran Martell, the wise and patient ruler of Dorne, and his fiery and determined siblings, such as Oberyn Martell, whose pursuit of justice led him to a fateful confrontation with the Lannisters. House Martell remains one of the most enigmatic houses of Westeros, embodying the fierce spirit and strength of Dorne and its people.",
      "image": "https://got-api-production.up.railway.app/assets/House_Martell.webp"
    },
    {
      "id": 10,
      "name": "House Tarly",
      "description": "House Tarly is a noble family of the Reach, sworn to House Tyrell, and known for their martial prowess and their reputation as fierce warriors. Their seat is at Horn Hill, a stronghold situated in the fertile hills of the Reach, overlooking the surrounding countryside. The Tarly sigil features a white sun pierced by a black spear on a green field, symbolizing their strength and martial tradition. House Tarly’s motto, \"First in Battle,\" reflects their longstanding reputation as one of the most formidable military families in Westeros. The Tarlys are renowned for their skilled knights and warriors, with many of their members holding high military ranks and distinguishing themselves on the battlefield. The head of House Tarly, Lord Randyll Tarly, is known for his strict and sometimes harsh demeanor, especially when it comes to his children and his expectations of them. His son, Samwell Tarly, was expected to follow in his father’s footsteps but was instead sent to the Night’s Watch, due to his father’s disdain for his perceived lack of strength and bravery. Despite the rigidness and severity within the family, House Tarly has been an important force in the Reach, loyal to House Tyrell and contributing to their military strength. The family’s pride in their martial heritage and their deep loyalty to their house and their lords ensures that House Tarly remains a respected and influential part of the Seven Kingdoms’ power structure, even if their members often struggle with personal ambition and family expectations.",
      "image": "https://got-api-production.up.railway.app/assets/House_Tarly.webp"
    },
    {
      "id": 11,
      "name": "House Bolton",
      "description": "House Bolton is a sinister and feared family of the North, with their seat at the Dreadfort, a grim and cold castle located in the far northeastern part of the North. Known for their cruelty and ruthlessness, the Boltons have earned a reputation as one of the most brutal families in Westeros. Their sigil, a flayed man, is a terrifying symbol of their brutal customs and their penchant for skinning their enemies alive, a tradition that dates back to the house's darker history. Their motto, \"A naked man has few secrets, a flayed man none,\" is a chilling reflection of their sadistic nature and their belief in complete domination over their foes. The Boltons were originally vassals to House Stark, but their treachery during the War of the Five Kings saw them betray the Starks and seize control of Winterfell. Under the leadership of Roose Bolton, the head of the house, they took the Stark stronghold, committing unspeakable atrocities, including the infamous \"Red Wedding\" massacre, which solidified their reputation for barbarity. Roose’s son, Ramsay Bolton, became infamous for his sadistic nature, terrorizing his subjects and enemies alike with cruelty and manipulation. House Bolton’s rise to power came through cunning, bloodshed, and betrayal, but their rule was marked by fear and instability. Their seat at the Dreadfort is a constant reminder of their brutal methods, and though they briefly held control over the North, the Boltons’ legacy is one of terror and destruction. Ultimately, House Bolton’s reign was short-lived, brought down by the forces of House Stark and their allies, leaving a dark stain on the history of the North.",
      "image": "https://got-api-production.up.railway.app/assets/House_Bolton.webp"
    },
    {
      "id": 12,
      "name": "House Mormont",
      "description": "House Mormont is a noble family of the North, sworn to House Stark, and renowned for their unwavering loyalty, bravery, and proud heritage. Their seat is at Bear Island, a rugged and windswept land in the far north of the North, surrounded by cold seas and harsh winters. The Mormonts have long been known as fierce warriors, with their sigil—a black bear on a green field—representing both their strength and the wild, untamed nature of their island home. Their motto, \"Here We Stand,\" reflects their steadfast commitment to their allies and their unyielding resolve in the face of danger. Despite their small size and relatively isolated location, House Mormont has consistently proven itself to be one of the most loyal and valiant families in the North, with every generation producing skilled fighters who stand alongside House Stark in times of war. The head of House Mormont, Lady Maege Mormont, was a respected and tough leader, and her daughter, the young but determined Lyanna Mormont, rose to prominence during the War of the Five Kings for her fierce speeches and leadership. Lyanna's bravery, particularly in the Battle of the Bastards, earned her widespread admiration, and her refusal to bow to anyone other than House Stark demonstrated the strength of her family’s bond to their northern roots. House Mormont's commitment to honor and duty, as well as their unbreakable loyalty to the Stark family, ensures that their legacy will endure in the face of adversity, even as their numbers dwindle and their lands remain threatened by the dangers of the North.",
      "image": "https://got-api-production.up.railway.app/assets/House_Mormont.webp"
    },
    {
      "id": 13,
      "name": "House Baelish",
      "description": "House Baelish is a relatively new but highly influential family in the political landscape of Westeros. Originating from the small, insignificant lands of the Fingers in the Vale of Arryn, the Baelish family’s rise to power is a testament to ambition, cunning, and a sharp understanding of politics. The family’s sigil is a black crow on a gold background, symbolizing the ominous and mysterious nature of their origins. House Baelish does not have a long history of noble bloodlines, but its most famous member, Petyr Baelish—known as Littlefinger—has played a pivotal role in the political chaos that shaped much of the realm’s modern history. Littlefinger started as a lowborn knight but managed to climb the ranks through manipulation, scheming, and exploiting the rivalries and weaknesses of others. He became Lord of the Vale and later the Master of Coin in King’s Landing, wielding immense power and influence behind the scenes. His ambition to control the Iron Throne and manipulate the major houses of Westeros was apparent throughout his machinations, from his role in the destabilization of House Stark to his efforts to marry into noble houses for personal gain. House Baelish's motto, \"A Lannister always pays his debts,\" though not their own, aligned them with wealthy houses, aiding their rise. However, their ambition eventually led to their downfall, as Littlefinger's deceptions and manipulations ultimately caught up with him. Though House Baelish may not have the ancient roots or grandeur of other great houses, their legacy is one defined by ambition, betrayal, and the dangerous allure of power.",
      "image": "https://got-api-production.up.railway.app/assets/House_Baelish.webp"
    },
    {
      "id": 14,
      "name": "House Clegane",
      "description": "House Clegane is a lesser noble family in the Westerlands, known for their fearsome reputation, strength, and brutal nature. Their seat is at Clegane's Keep, a modest but well-fortified castle near the larger, more influential houses of the region. Despite their relatively low status, House Clegane's notoriety comes primarily from its two most infamous members: Sandor \"The Hound\" Clegane and Gregor \"The Mountain\" Clegane. Both brothers are among the most feared individuals in Westeros, known for their savage strength and terrifying violence. The Clegane sigil is a simple but striking black dog on a yellow field, representing their ferocity and connection to the beastly side of their nature. The family’s history is marked by brutal deeds, and their story is one of cruelty, vengeance, and power. Sandor Clegane, often referred to as \"The Hound,\" served as a brutal enforcer for House Lannister but eventually turned against them, seeking redemption and a path away from violence, though his dark past continued to haunt him. His brother, Gregor Clegane, known as \"The Mountain,\" was a legendary figure of terror, a giant of a man who committed countless atrocities on behalf of the Lannisters, earning a reputation as one of the most fearsome and evil men in Westeros. The Cleganes’ reputation is one of monstrous strength, cruelty, and a thirst for power, making them both reviled and feared across the realm. Though House Clegane remains a minor house, their impact on the history of Westeros, due to the infamous actions of its two most powerful members, has left an indelible mark.",
      "image": "https://got-api-production.up.railway.app/assets/House_Clegane.webp"
    },
    {
      "id": 15,
      "name": "House Seaworth",
      "description": "House Seaworth is a relatively new but respected family in Westeros, known for its humble origins and remarkable rise to nobility. The house’s seat is at the seaside castle of Seaworth, located on the Stormlands coast, not far from the lands of House Baratheon. House Seaworth’s sigil is a simple but striking image of a black ship under a silver moon, symbolizing their connection to the sea and their history as seafarers. The family was originally founded by Davos Seaworth, a former smuggler who rose to prominence through his loyalty, resourcefulness, and service to Stannis Baratheon during Robert’s Rebellion and later during Stannis’s campaign for the Iron Throne. Davos earned the nickname \"The Onion Knight\" for his past involvement in smuggling onions to the starving forces of Storm's End, an act that earned him Stannis’s favor and ultimately a knighthood. His rise from a commoner to a knight, and eventually the Lord of Seaworth, is a story of merit, loyalty, and personal honor. House Seaworth’s motto, \"A Seaworth always sails true,\" reflects their steadfastness and determination to stay true to their values, despite their humble beginnings. Despite their relatively recent elevation to nobility, House Seaworth has earned respect for their naval expertise and unwavering loyalty, especially in the aftermath of Stannis’s death. The family’s history of loyalty and its connection to the sea ensure that House Seaworth will remain a fixture in Westeros for generations to come.",
      "image": "https://got-api-production.up.railway.app/assets/House_Seaworth.webp"
    },
    {
      "id": 16,
      "name": "House Uller",
      "description": "House Uller is a proud and ancient family from Dorne, known for their fierce independence, warrior spirit, and deep ties to the harsh, arid lands of the region. Their seat is at the stronghold of Hellholt, a castle situated in the central part of Dorne, surrounded by the desert-like terrain of the region. House Uller’s sigil features a gold scorpion on a red field, symbolizing their connection to the dangerous and deadly wildlife of Dorne, as well as the deadly sting of the scorpion itself. The Ullers are known for their military prowess and are often seen as one of the more feared houses in Dorne, with a long history of defending their lands against invaders and rivals alike. Their motto, \"Vengeance is the Sword,\" reflects the family’s vengeful nature and their readiness to fight for justice, especially when it comes to matters of honor or perceived wrongs. House Uller has a reputation for being fierce, ruthless, and fiercely loyal to the people and lands of Dorne. They were deeply involved in the resistance against the Targaryen invasion, and since then, have maintained an independent and proud stance within the kingdom. Key figures from House Uller include the formidable female warrior, Lady Ashara Uller, and her descendants, who have continued the family’s tradition of military service. The Ullers’ influence in Dorne is built on their toughness, their capacity for vengeance, and their strong connections to their harsh desert homeland. Their willingness to fight for their own and to avenge their wrongs ensures their legacy in the history of Dorne.",
      "image": "https://got-api-production.up.railway.app/assets/House_Uller.webp"
    },
    {
      "id": 17,
      "name": "Free Folk",
      "description": "The Free Folk, often referred to as the Wildlings, are the nomadic and fiercely independent people who inhabit the lands beyond the Wall, far from the reach of the Seven Kingdoms. They are not a single unified house or clan, but rather a diverse and loosely organized group of tribes, clans, and communities who live in the frozen wilderness north of the Wall. The Free Folk’s lifestyle is one defined by survival, strength, and self-sufficiency, as they are constantly threatened by the harsh conditions of their environment, the dangers of wild animals, and the looming presence of the White Walkers. Their sigil, if they were to have one, would be a simple yet powerful symbol of defiance, as the Free Folk reject the authority of the Seven Kingdoms and all noble houses, including House Stark, whom they view as invaders of their lands. The Free Folk’s motto could be said to be \"We Are the Free,\" for they pride themselves on their autonomy and the freedom that comes from living outside the structured and often oppressive rule of the South. The Free Folk have long been looked down upon by the people of the Seven Kingdoms, who view them as savage and primitive. However, the Free Folk have a rich culture, with their own customs, laws, and traditions that are tied to their land and way of life. They are primarily warriors, hunters, and craftsmen, with each clan having its own strengths. Notable figures such as Mance Rayder, the King-Beyond-the-Wall, have tried to unite the Free Folk into a single force capable of challenging the power of the Night's Watch and the Seven Kingdoms. The Free Folk are also fiercely loyal to their own kin, and their survival often depends on close-knit communities. Though they live without the luxuries and wealth of the South, they are deeply connected to the land, and their resilience and courage are unmatched. Over time, as the threat of the White Walkers becomes more imminent, the Free Folk find themselves reluctantly aligning with the Night's Watch and even the people of the South in order to defend Westeros from the greater threat. The Free Folk’s story is one of survival, independence, and a never-ending struggle against the cold and the unknown, with their people continuing to fight for their freedom and existence in a world that increasingly encroaches upon their way of life.",
      "image": "https://got-api-production.up.railway.app/assets/Free_folk.webp"
    }
  ]
  